IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_EQEP0_CONTROLSS_EQEP0.xml
	<register id="CONTROLSS_EQEP0_QCAPCTL" acronym="CONTROLSS_EQEP0_QCAPCTL" offset="0x2C" width="16" description="">
		<bitfield id="CEN" width="1" begin="15" end="15" resetval="0x0" description="Enable eQEP capture    0   |   CEN_DISABLEeQEP capture unit is disabled      1   |   CEN_ENABLEeQEP capture unit is enabled  " range="15" rwaccess="RW"/> 
		<bitfield id="CCPS" width="3" begin="6" end="4" resetval="0x0" description="eQEP capture timer clock prescaler    0x0   |   SYSCLKOUT1CAPCLK = SYSCLKOUT/1      0x1   |   SYSCLKOUT2CAPCLK = SYSCLKOUT/2      0x2   |   SYSCLKOUT4CAPCLK = SYSCLKOUT/4      0x3   |   SYSCLKOUT8CAPCLK = SYSCLKOUT/8      0x4   |   SYSCLKOUT16CAPCLK = SYSCLKOUT/16      0x5   |   SYSCLKOUT32CAPCLK = SYSCLKOUT/32      0x6   |   SYSCLKOUT64CAPCLK = SYSCLKOUT/64      0x7   |   SYSCLKOUT128CAPCLK = SYSCLKOUT/128  " range="6 - 4" rwaccess="RW"/> 
		<bitfield id="UPPS" width="4" begin="3" end="0" resetval="0x0" description="Unit position event prescaler    0x0   |   QCLK1UPEVNT = QCLK/1      0x1   |   QCLK2UPEVNT = QCLK/2      0x2   |   QCLK4UPEVNT = QCLK/4      0x3   |   QCLK8UPEVNT = QCLK/8      0x4   |   QCLK16UPEVNT = QCLK/16      0x5   |   QCLK32UPEVNT = QCLK/32      0x6   |   QCLK64UPEVNT = QCLK/64      0x7   |   QCLK128UPEVNT = QCLK/128      0x8   |   QCLK256UPEVNT = QCLK/256      0x9   |   QCLK512UPEVNT = QCLK/512      0xA   |   QCLK1024UPEVNT = QCLK/1024      0xB   |   QCLK2048UPEVNT = QCLK/2048      0xC   |   QCLK_RSVD0Reserved      0xD   |   QCLK_RSVD1Reserved      0xE   |   QCLK_RSVD2Reserved      0xF   |   QCLK_RSVD3Reserved  " range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP0_QPOSCTL" acronym="CONTROLSS_EQEP0_QPOSCTL" offset="0x2E" width="16" description="">
		<bitfield id="PCSHDW" width="1" begin="15" end="15" resetval="0x0" description="Position compare of shadow enable    0   |   PCSHDW_DISABLEShadow disabled, load Immediate      1   |   PCSHDW_ENABLEShadow enabled  " range="15" rwaccess="RW"/> 
		<bitfield id="PCLOAD" width="1" begin="14" end="14" resetval="0x0" description="Position compare of shadow load    0   |   PCLOAD_0Load on QPOSCNT = 0      1   |   PCLOAD_QPOSCMPLoad when QPOSCNT = QPOSCMP  " range="14" rwaccess="RW"/> 
		<bitfield id="PCPOL" width="1" begin="13" end="13" resetval="0x0" description="Polarity of sync output    0   |   PCPOL_HIGHActive HIGH pulse output      1   |   PCPOL_LOWActive LOW pulse output  " range="13" rwaccess="RW"/> 
		<bitfield id="PCE" width="1" begin="12" end="12" resetval="0x0" description="Position compare enable/disable    0   |   PCE_DISABLEDisable position compare unit      1   |   PCE_ENABLEEnable position compare unit  " range="12" rwaccess="RW"/> 
		<bitfield id="PCSPW" width="12" begin="11" end="0" resetval="0x0" description="Select-position-compare sync output pulse width    0x000   |   SYSCLKOUT41 * 4 * SYSCLKOUT cycles      0x001   |   SYSCLKOUT82 * 4 * SYSCLKOUT cycles      0xFFF   |   SYSCLKOUT163844096 * 4 * SYSCLKOUT cycles  " range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP0_QEINT" acronym="CONTROLSS_EQEP0_QEINT" offset="0x30" width="16" description="">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="QMA Error Interrupt enable    0   |   QMAE_DISABLEInterrupt is disabled      1   |   QMAE_ENABLEInterrupt is enabled  " range="12" rwaccess="RW"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Unit time out interrupt enable    0   |   UTO_DISABLEInterrupt is disabled      1   |   UTO_ENABLEInterrupt is enabled  " range="11" rwaccess="RW"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Index event latch interrupt enable    0   |   IEL_DISABLEInterrupt is disabled      1   |   IEL_ENABLEInterrupt is enabled  " range="10" rwaccess="RW"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Strobe event latch interrupt enable    0   |   SEL_DISABLEInterrupt is disabled      1   |   SEL_ENABLEInterrupt is enabled  " range="9" rwaccess="RW"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Position-compare match interrupt enable    0   |   PCM_DISABLEInterrupt is disabled      1   |   PCM_ENABLEInterrupt is enabled  " range="8" rwaccess="RW"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Position-compare ready interrupt enable    0   |   PCR_DISABLEInterrupt is disabled      1   |   PCR_ENABLEInterrupt is enabled  " range="7" rwaccess="RW"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Position counter overflow interrupt enable    0   |   PCO_DISABLEInterrupt is disabled      1   |   PCO_ENABLEInterrupt is enabled  " range="6" rwaccess="RW"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Position counter underflow interrupt enable    0   |   PCU_DISABLEInterrupt is disabled      1   |   PCU_ENABLEInterrupt is enabled  " range="5" rwaccess="RW"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Watchdog time out interrupt enable    0   |   WTO_DISABLEInterrupt is disabled      1   |   WTO_ENABLEInterrupt is enabled  " range="4" rwaccess="RW"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Quadrature direction change interrupt enable    0   |   QDC_DISABLEInterrupt is disabled      1   |   QDC_ENABLEInterrupt is enabled  " range="3" rwaccess="RW"/> 
		<bitfield id="QPE" width="1" begin="2" end="2" resetval="0x0" description="Quadrature phase error interrupt enable    0   |   QPE_DISABLEInterrupt is disabled      1   |   QPE_ENABLEInterrupt is enabled  " range="2" rwaccess="RW"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Position counter error interrupt enable    0   |   PCE_DISABLEInterrupt is disabled      1   |   PCE_ENABLEInterrupt is enabled  " range="1" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP0_QFLG" acronym="CONTROLSS_EQEP0_QFLG" offset="0x32" width="16" description="">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="QMA Error interrupt flag    Read0   |   QMAE_NOFLAGNo interrupt generated      Read1   |   QMAE_FLAGInterrupt was generated  " range="12" rwaccess="RO"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Unit time out interrupt flag    Read0   |   UTO_NOFLAGNo interrupt generated      Read1   |   UTO_FLAGSet by eQEP unit timer period match  " range="11" rwaccess="RO"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Index event latch interrupt flag    Read0   |   IEL_NOFLAGNo interrupt generated      Read1   |   IEL_FLAGThis bit is set after latching the QPOSCNT to QPOSILAT  " range="10" rwaccess="RO"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Strobe event latch interrupt flag    Read0   |   SEL_NOFLAGNo interrupt generated      Read1   |   SEL_FLAGThis bit is set after latching the QPOSCNT to QPOSSLAT  " range="9" rwaccess="RO"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="eQEP compare match event interrupt flag    Read0   |   PCM_NOFLAGNo interrupt generated      Read1   |   PCM_FLAGThis bit is set on position-compare match  " range="8" rwaccess="RO"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Position-compare ready interrupt flag    Read0   |   PCR_NOFLAGNo interrupt generated      Read1   |   PCR_FLAGThis bit is set after transferring the shadow register value to the active position compare register  " range="7" rwaccess="RO"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Position counter overflow interrupt flag    Read0   |   PCO_NOFLAGNo interrupt generated      Read1   |   PCO_FLAGThis bit is set on position counter overflow.  " range="6" rwaccess="RO"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Position counter underflow interrupt flag    Read0   |   PCU_NOFLAGNo interrupt generated      Read1   |   PCU_FLAGThis bit is set on position counter underflow.  " range="5" rwaccess="RO"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Watchdog timeout interrupt flag    Read0   |   WTO_NOFLAGNo interrupt generated      Read1   |   WTO_FLAGSet by watchdog timeout  " range="4" rwaccess="RO"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Quadrature direction change interrupt flag    Read0   |   QDC_NOFLAGNo interrupt generated      Read1   |   QDC_FLAGInterrupt was generated  " range="3" rwaccess="RO"/> 
		<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Quadrature phase error interrupt flag    Read0   |   PHE_NOFLAGNo interrupt generated      Read1   |   PHE_FLAGSet on simultaneous transition of QEPA and QEPB  " range="2" rwaccess="RO"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Position counter error interrupt flag    Read0   |   PCE_NOFLAGNo interrupt generated      Read1   |   PCE_FLAGPosition counter error  " range="1" rwaccess="RO"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global interrupt status flag    Read0   |   INT_NOFLAGNo interrupt generated      Read1   |   INT_FLAGInterrupt was generated  " range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP0_QCLR" acronym="CONTROLSS_EQEP0_QCLR" offset="0x34" width="16" description="">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="Clear QMA Error interrupt flag    0   |   QMAE_NOEFFECTNo effect      1   |   QMAE_CLRClears the interrupt flag  " range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Clear unit time out interrupt flag    0   |   UTO_NOEFFECTNo effect      1   |   UTO_CLRClears the interrupt flag  " range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Clear index event latch interrupt flag    0   |   IEL_NOEFFECTNo effect      1   |   IEL_CLRClears the interrupt flag  " range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Clear strobe event latch interrupt flag    0   |   SEL_NOEFFECTNo effect      1   |   SEL_CLRClears the interrupt flag  " range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Clear eQEP compare match event interrupt flag    0   |   PCM_NOEFFECTNo effect      1   |   PCM_CLRClears the interrupt flag  " range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Clear position-compare ready interrupt flag    0   |   PCR_NOEFFECTNo effect      1   |   PCR_CLRClears the interrupt flag  " range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Clear position counter overflow interrupt flag    0   |   PCO_NOEFFECTNo effect      1   |   PCO_CLRClears the interrupt flag  " range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Clear position counter underflow interrupt flag    0   |   PCU_NOEFFECTNo effect      1   |   PCU_CLRClears the interrupt flag  " range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Clear watchdog timeout interrupt flag    0   |   WTO_NOEFFECTNo effect      1   |   WTO_CLRClears the interrupt flag  " range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Clear quadrature direction change interrupt flag    0   |   QDC_NOEFFECTNo effect      1   |   QDC_CLRClears the interrupt flag  " range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Clear quadrature phase error interrupt flag    0   |   PHE_NOEFFECTNo effect      1   |   PHE_CLRClears the interrupt flag  " range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Clear position counter error interrupt flag    0   |   PCE_NOEFFECTNo effect      1   |   PCE_CLRClears the interrupt flag  " range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global interrupt clear flag    0   |   INT_NOEFFECTNo effect      1   |   INT_CLRClears the interrupt flag  " range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_EQEP0_QFRC" acronym="CONTROLSS_EQEP0_QFRC" offset="0x36" width="16" description="">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="Force QMA error interrupt    0   |   QMAE_NOEFFECTNo effect      1   |   QMAE_FORCEForce the interrupt  " range="12" rwaccess="RW"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Force unit time out interrupt    0   |   UTO_NOEFFECTNo effect      1   |   UTO_FORCEForce the interrupt  " range="11" rwaccess="RW"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Force index event latch interrupt    0   |   IEL_NOEFFECTNo effect      1   |   IEL_FORCEForce the interrupt  " range="10" rwaccess="RW"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Force strobe event latch interrupt    0   |   SEL_NOEFFECTNo effect      1   |   SEL_FORCEForce the interrupt  " range="9" rwaccess="RW"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Force position-compare match interrupt    0   |   PCM_NOEFFECTNo effect      1   |   PCM_FORCEForce the interrupt  " range="8" rwaccess="RW"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Force position-compare ready interrupt    0   |   PCR_NOEFFECTNo effect      1   |   PCR_FORCEForce the interrupt  " range="7" rwaccess="RW"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Force position counter overflow interrupt    0   |   PCO_NOEFFECTNo effect      1   |   PCO_FORCEForce the interrupt  " range="6" rwaccess="RW"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Force position counter underflow interrupt    0   |   PCU_NOEFFECTNo effect      1   |   PCU_FORCEForce the interrupt  " range="5" rwaccess="RW"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Force watchdog time out interrupt    0   |   WTO_NOEFFECTNo effect      1   |   WTO_FORCEForce the interrupt  " range="4" rwaccess="RW"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Force quadrature direction change interrupt    0   |   QDC_NOEFFECTNo effect      1   |   QDC_FORCEForce the interrupt  " range="3" rwaccess="RW"/> 
		<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Force quadrature phase error interrupt    0   |   PHE_NOEFFECTNo effect      1   |   PHE_FORCEForce the interrupt  " range="2" rwaccess="RW"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Force position counter error interrupt    0   |   PCE_NOEFFECTNo effect      1   |   PCE_FORCEForce the interrupt  " range="1" rwaccess="RW"/>
	</register>
