IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_EQEP0_CONTROLSS_EQEP0.xml
	<register id="CONTROLSS_EQEP0_QEPSTS" acronym="CONTROLSS_EQEP0_QEPSTS" offset="0x38" width="16" description="">
		<bitfield id="UPEVNT" width="1" begin="7" end="7" resetval="0x1" description="Unit position event flag    0   |   UPEVNT_NODETCTNo unit position event detected      1   |   UPEVNT_DETCTUnit position event detected. Write 1 to clear  " range="7" rwaccess="RW"/> 
		<bitfield id="FIDF" width="1" begin="6" end="6" resetval="0x0" description="Direction on the first index marker Status of the direction is latched on the first index event marker.    Read0   |   FIDF_COUNTERCLKCounter-clockwise rotation (or reverse movement) on the first index event      Read1   |   FIDF_CLKClockwise rotation (or forward movement) on the first index event  " range="6" rwaccess="RO"/> 
		<bitfield id="QDF" width="1" begin="5" end="5" resetval="0x0" description="Quadrature direction flag    Read0   |   QDF_COUNTERCLKCounter-clockwise rotation (or reverse movement)      Read1   |   QDF_CLKClockwise rotation (or forward movement)  " range="5" rwaccess="RO"/> 
		<bitfield id="QDLF" width="1" begin="4" end="4" resetval="0x0" description="eQEP direction latch flag    Read0   |   QDLF_COUNTERCLKCounter-clockwise rotation (or reverse movement) on index event marker      Read1   |   QDLF_CLKClockwise rotation (or forward movement) on index event marker  " range="4" rwaccess="RO"/> 
		<bitfield id="COEF" width="1" begin="3" end="3" resetval="0x0" description="Capture overflow error flag    0   |   COEF_WRT1Overflow has not occurred.      1   |   COEF_OVFOverflow occurred in eQEP Capture timer (QEPCTMR). This bit is cleared by writing a '1'.  " range="3" rwaccess="RW"/> 
		<bitfield id="CDEF" width="1" begin="2" end="2" resetval="0x0" description="Capture direction error flag    0   |   CDEF_WRT1Capture direction error has not occurred.      1   |   CDEF_DIRECTDirection change occurred between the capture position event. This bit is cleared by writing a '1'.  " range="2" rwaccess="RW"/> 
		<bitfield id="FIMF" width="1" begin="1" end="1" resetval="0x0" description="First index marker flag    0   |   FIMF_WRT1First index pulse has not occurred.      1   |   FIMF_SETINDEXSet by first occurrence of index pulse.  This bit is cleared by writing a '1'.  " range="1" rwaccess="RW"/> 
		<bitfield id="PCEF" width="1" begin="0" end="0" resetval="0x0" description="Position counter error flag.  This bit is not sticky and it is updated for every index event.    Read0   |   PCEF_NOERRORNo error occurred during the last index transition      Read1   |   PCEF_ERRORPosition counter error  " range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP0_QCTMR" acronym="CONTROLSS_EQEP0_QCTMR" offset="0x3A" width="16" description="">
		<bitfield id="QCTMR" width="16" begin="15" end="0" resetval="0x0" description="This register provides time base for edge capture unit." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP0_QCPRD" acronym="CONTROLSS_EQEP0_QCPRD" offset="0x3C" width="16" description="">
		<bitfield id="QCPRD" width="16" begin="15" end="0" resetval="0x0" description="This register holds the period count value between the last successive eQEP position events" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP0_QCTMRLAT" acronym="CONTROLSS_EQEP0_QCTMRLAT" offset="0x3E" width="16" description="">
		<bitfield id="QCTMRLAT" width="16" begin="15" end="0" resetval="0x0" description="The eQEP capture timer value can be latched into this register on two events viz., unit timeout event, reading the eQEP position counter." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP0_QCPRDLAT" acronym="CONTROLSS_EQEP0_QCPRDLAT" offset="0x40" width="16" description="">
		<bitfield id="QCPRDLAT" width="16" begin="15" end="0" resetval="0x0" description="eQEP capture period value can be latched into this register on two events viz., unit timeout event, reading the eQEP position counter." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP0_REV" acronym="CONTROLSS_EQEP0_REV" offset="0x60" width="32" description="">
		<bitfield id="MINOR" width="3" begin="5" end="3" resetval="0x2" description="This field specifies the Minor Revision number for the eQEP IP." range="5 - 3" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="2" end="0" resetval="0x1" description="This field specifies the Major Revision number for the eQEP IP." range="2 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP0_QEPSTROBESEL" acronym="CONTROLSS_EQEP0_QEPSTROBESEL" offset="0x64" width="32" description="">
		<bitfield id="STROBESEL" width="2" begin="1" end="0" resetval="0x0" description="Strobe source select:    0x0   |   QS_AFTER_POL_MUXQEP Strobe after polarity mux      0x1   |   QS_AFTER_POL_MUXQEP Strobe after polarity mux      0x2   |   ADCSOCA_AS_QSQEP Strobe after polarity mux ORed with ADCSOCA      0x3   |   ADCSOCB_AS_QSQEP Strobe after polarity mux ORed with ADCSOCB  " range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP0_QMACTRL" acronym="CONTROLSS_EQEP0_QMACTRL" offset="0x68" width="32" description="">
		<bitfield id="MODE" width="3" begin="2" end="0" resetval="0x0" description="Select Mode for QMA mode: 000 : QMA Module is bypassed.  001 : QMA Mode-1 operation selected 010 : QMA Mode-2 operation selected 011 : QMA Module is bypassed (reserved) 1xx  : QMA Module is bypassed (reserved)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP0_QEPSRCSEL" acronym="CONTROLSS_EQEP0_QEPSRCSEL" offset="0x6C" width="32" description="">
		<bitfield id="QEPSSEL" width="5" begin="28" end="24" resetval="0x0" description="QEP Strobe source select:  0x0: Device Pin (Default) 0x1 to 0x1F : To be defined in SOC context  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="28 - 24" rwaccess="RW"/> 
		<bitfield id="QEPISEL" width="5" begin="20" end="16" resetval="0x0" description="QEP Index source select: 0x0: Device Pin (Default) 0x1 to 0x1F : To be defined in SOC context  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="20 - 16" rwaccess="RW"/> 
		<bitfield id="QEPBSEL" width="5" begin="12" end="8" resetval="0x0" description="QEPB source select: 0x0: Device Pin (Default) 0x1 to 0x1F : To be defined in SOC context  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="12 - 8" rwaccess="RW"/> 
		<bitfield id="QEPASEL" width="5" begin="4" end="0" resetval="0x0" description="QEPA source select: 0x0: Device Pin (Default) 0x1 to 0x1F : To be defined in SOC context  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="4 - 0" rwaccess="RW"/>
	</register>
</module>